---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs.OriginalPath
source: html/919da995-c1da-fc86-2041-5782fcb9435c.htm
---
# Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs.OriginalPath Property

Original path of the document.

## Syntax (C#)
```csharp
public string OriginalPath { get; }
```